测试数据

In [12]:
import numpy as np
import pandas as pd

df = pd.DataFrame(
    {'name': ['张三', '李四', '王五', '马六', '赵七'],
     'sex': ['male', 'female', np.nan, 'male', 'female'],
     'age': [10, np.nan, np.nan, np.nan, 34]
    }
)

DataFrame.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)


**功能**
dropna 允许你以不同的方式处理缺失值（NaNs 或者是 NaT 标记的数据），包括完全移除包含缺失值的行或列。

**参数**
axis: {0 or 'index', 1 or 'columns'}, 默认为0。决定是删除包含缺失值的行还是列。
how: {'any', 'all'}, 默认为'any'。如果为'any'，则删除包含任何缺失值的行或列；如果为'all'，则只删除那些所有值都是缺失值的行或列。
thresh: int, 可选。指定非缺失值的最小数量，只有当行或列的非缺失值少于这个数量时，才会被删除。
subset: array-like, 可选。在哪一行或列上查找缺失值。如果指定了这个参数，那么只有这些指定的行或列会被检查和删除。
inplace: bool, 默认为False。如果为True，则在原地修改DataFrame，不返回任何值。

某一行有空值，则删除这一行

In [5]:
df.dropna(axis=0)

  name     sex   age
0   张三    male  10.0
4   赵七  female  34.0

某一列有空值，则删除这一列

In [6]:
df.dropna(axis=1)

  name
0   张三
1   李四
2   王五
3   马六
4   赵七

设置为any，这也是默认值，某行有空值，则删除这一行

In [7]:
df.dropna(how='any')

  name     sex   age
0   张三    male  10.0
4   赵七  female  34.0

设置为all，某行全部是空值，则删除这一行

In [10]:
df.dropna(how='all')

  name     sex   age
0   张三    male  10.0
1   李四  female   NaN
2   王五     NaN   NaN
3   马六    male   NaN
4   赵七  female  34.0

In [ ]:
只对某列的数据，出现空值的话，删除所在行

In [13]:
df.dropna(subset=['name', 'sex'])

  name     sex   age
0   张三    male  10.0
1   李四  female   NaN
3   马六    male   NaN
4   赵七  female  34.0

当有指定个数或以上的空值时才删除

In [14]:
df.dropna(thresh=2)

  name     sex   age
0   张三    male  10.0
1   李四  female   NaN
3   马六    male   NaN
4   赵七  female  34.0

inplace如果设置成True的话，直接修改原数据，否则生成一个新的DataFrame

In [15]:
df.dropna(inplace=False)
print(df)
df.dropna(inplace=True)
print(df)

  name     sex   age
0   张三    male  10.0
1   李四  female   NaN
2   王五     NaN   NaN
3   马六    male   NaN
4   赵七  female  34.0
  name     sex   age
0   张三    male  10.0
4   赵七  female  34.0